In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
index_ = [1, 2, 3]
names = ['Lama', 'Layan', 'Tolen']
s1 = pd.Series(names, index=index_)
s1

1     Lama
2    Layan
3    Tolen
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
s1.index= [11, 12, 13]
s1

11     Lama
12    Layan
13    Tolen
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
s1.head(2)

11     Lama
12    Layan
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
s2 = pd.Series({14: 'Lama', 15: 'Nada'})
# s1 = s1.append(s2)
s1= pd.concat([s1, s2])
s1

11     Lama
12    Layan
13    Tolen
14     Lama
15     Nada
dtype: object

In [8]:
s1 = s1.drop_duplicates()
s1

11     Lama
12    Layan
13    Tolen
15     Nada
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [31]:
 data = {'ID': ['1111111111', '222222222', '333333333', '444444444'],
        'Name': ['Lama', 'Ahlam', 'Amal','Alaa'],
        'GPA': [3.99, 3.98, 2.56, 4]
       }

SalesDF = pd.DataFrame(data, columns=["ID","Name", "GPA"])
SalesDF

           ID   Name   GPA
0  1111111111   Lama  3.99
1   222222222  Ahlam  3.98
2   333333333   Amal  2.56
3   444444444   Alaa  4.00

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [21]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [27]:
print("slice")
edu[3:7]

slice

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e

In [28]:
print("loc")
edu.loc[3:7]

loc

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e